app/controllers/enemies_controller.rb

SELECT * FROM "enemies"
---
  def index
    @enemies = Enemy.all

SELECT * FROM "enemies" WHERE ("enemies"."id" = 1)
---
  def show
    @enemy = Enemy.find(params[:id])

SELECT * FROM "enemies" WHERE ("enemies"."id" = 1)
---
  def edit
    @enemy = Enemy.find(params[:id])

INSERT INTO "enemies" ("name", "defense", "link_id", "strength", "updated_at", "level", "intuition", "perception", "attack", "agility", "intelligence", "charisma", "health", "created_at") VALUES('bugbear', 12, NULL, 12, '2010-12-31 01:37:41', NULL, 12, 12, 12, 12, 12, 12, 12, '2010-12-31 01:37:41')
---
  def create
    @enemy = Enemy.new(params[:enemy])

    respond_to do |format|
      if @enemy.save