app/controllers/links_controller.rb

  def index
    @links = Link.all
---
SELECT * FROM "links"

  def show
    @link = Link.find(params[:id])
    @locations = Location.find(:all, :order => :name, :conditions => {:link_id => nil})
---
SELECT * FROM "links" WHERE ("links"."id" = 1)
SELECT * FROM "locations" WHERE ("locations"."link_id" IS NULL) ORDER BY name

  def edit
    @link = Link.find(params[:id])
---
SELECT * FROM "links" WHERE ("links"."id" = 1)

  def assign_location
    @link = Link.find(params[:id])
    @link.location = Location.find(params[:location_id])
---
SELECT * FROM "links" WHERE ("links"."id" = 3)
SELECT * FROM "locations" WHERE ("locations".link_id = 3) LIMIT 1

  def create
    @link = Link.new(params[:link])

    respond_to do |format|
      if @link.save
---
INSERT INTO "links" ("name", "updated_at", "location_id", "lat", "long", "created_at") VALUES(NULL, '2010-11-08 03:50:44', NULL, NULL, NULL, '2010-11-08 03:50:44')

  def destroy
    @link = Link.find(params[:id])
    @link.destroy
---
SELECT * FROM "links" WHERE ("links"."id" = 1)
DELETE FROM "links" WHERE "id" = 1