app/controllers/locations_controller.rb

  def show_all_links
    @locations = Location.all
---
SELECT * FROM "locations" WHERE ("locations".link_id = 2) LIMIT 1

  def index
    @locations = Location.all
---
SELECT * FROM "locations"

  def show
    @location = Location.find(params[:id])
---
SELECT * FROM "locations" WHERE ("locations".link_id = 2) LIMIT 1

  def edit
    @location = Location.find(params[:id])
---
SELECT * FROM "locations" WHERE ("locations"."id" = 3)

  def destroy
    @location = Location.find(params[:id])
    @location.destroy
---
SELECT * FROM "locations" WHERE ("locations"."id" = 1)
DELETE FROM "locations" WHERE "id" = 1

  def new_link
    link = Link.create(:name => params[:name], :lat => params[:lat], :long => params[:long], :radius => params[:radius])
    loc = Location.find(params[:id])
    loc.links << link unless loc.links.include?(link)
---
INSERT INTO "links" ("lat1", "long2", "name", "lat2", "updated_at", "location_id", "long1", "created_at") VALUES(184, 271, NULL, 206, '2010-11-21 04:20:08', NULL, 242, '2010-11-21 04:20:08')
SELECT * FROM "locations" WHERE ("locations"."id" = 1)
SELECT "links".id FROM "links" INNER JOIN "links_locations" ON "links".id = "links_locations".link_id WHERE ("links"."id" = 1) AND ("links_locations".location_id = 1 ) LIMIT 1

  def remove_link
    location = Location.find params[:id]
    link = Link.find params[:link_id]
---
SELECT * FROM "locations" WHERE ("locations"."id" = 1)
SELECT * FROM "links" WHERE ("links"."id" = 1)