app/controllers/travels_controller.rb

SELECT * FROM "locations" WHERE ("locations".link_id = 2) LIMIT 1
---
  def index
    @location = Location.first

SELECT * FROM "locations" WHERE ("locations".link_id = 3) LIMIT 1
---
  def show
    @location = Location.find(params[:id])